Rhino.DocObjects.RhinoObject.WorksessionReferenceSerialNumber
Worksession reference model id.
0: layer is not in a reference model.
1: layer is in an unidentified worksession reference model.
>1000: Serial number of the worksession reference model.
The reference model serial number is a runtime value.
It is not saved in files and it is generally different the
next time a file is read.