Rhino.Geometry.Collections.MeshFaceList.DeleteFaces(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Removes a collection of faces from the mesh without affecting the remaining geometry.
faceIndexes: An array containing all the face indices to be removed.
compact: Delete any unreferenced objects from arrays, reindexes as needed, and shrinks arrays to minimum required size.
Returns: The number of faces deleted on success.

Rhino.Geometry.Collections.MeshFaceList.RemoveAt(System.Int32,System.Boolean)
Removes a face from the mesh.
index: The index of the face that will be removed.
compact: Delete any unreferenced objects from arrays, reindexes as needed, and shrinks arrays to minimum required size.
Throws System.ArgumentOutOfRangeException: If index is < 0 or >= Count.