Grasshopper.Kernel.GH_Document.DrawPreview
Determine whether previews are drawn in a viewport.
This only happens if the document is currently loaded in the active canvas,
or the remote control panel is active.